avr-rust/avrd/packs/atmega/ATmega16HVB.atdf
    <module caption="EEPROM" name="EEPROM">
      <register-group caption="EEPROM" name="EEPROM">
        <register caption="EEPROM Read/Write Access" name="EEAR" offset="0x41" size="2" mask="0x03FF">
          <bitfield caption="EEPROM Address bits" mask="0x03FF" name="EEAR"/>
        </register>
        <register caption="EEPROM Data Register" name="EEDR" offset="0x40" size="1" mask="0xFF">
          <bitfield caption="EEPROM Data bits" mask="0xFF" name="EEDR"/>
        </register>
        <register caption="EEPROM Control Register" name="EECR" offset="0x3F" size="1">
          <bitfield caption="" mask="0x30" name="EEPM" values="EEP_MODE"/>
          <bitfield caption="EEProm Ready Interrupt Enable" mask="0x08" name="EERIE"/>
          <bitfield caption="EEPROM Master Write Enable" mask="0x04" name="EEMPE"/>
          <bitfield caption="EEPROM Write Enable" mask="0x02" name="EEPE"/>
          <bitfield caption="EEPROM Read Enable" mask="0x01" name="EERE"/>
        </register>
      </register-group>
      <value-group caption="" name="EEP_MODE">
        <value caption="Erase and Write in one operation" name="VAL_0x00" value="0x00"/>
        <value caption="Erase Only" name="VAL_0x01" value="0x01"/>
        <value caption="Write Only" name="VAL_0x02" value="0x02"/>
      </value-group>
    </module>
    <module caption="Coulomb Counter" name="COULOMB_COUNTER">
      <register-group caption="Coulomb Counter" name="COULOMB_COUNTER">
        <register caption="CC-ADC Control and Status Register A" name="CADCSRA" offset="0xE6" size="1">
          <bitfield caption="When the CADEN bit is cleared (zero), the CC-ADC is disabled. When the CADEN bit is set (one), the CC-ADC will continuously measure the voltage drop over the external sense resistor RSENSE. In Power-down, only the Regular Current detection is active. In Power-off, the CC-ADC is always disabled." mask="0x80" name="CADEN"/>
          <bitfield caption="" mask="0x40" name="CADPOL"/>
          <bitfield caption="CC_ADC Update Busy" mask="0x20" name="CADUB"/>
          <bitfield caption="CC_ADC Accumulate Current Select Bits" mask="0x18" name="CADAS"/>
          <bitfield caption="The CADSI bits determine the current sampling interval for the Regular Current detection in Power-down mode. The actual settings remain to be determined." mask="0x06" name="CADSI"/>
          <bitfield caption="When the CADSE bit is written to one, the ongoing CC-ADC conversion is aborted, and the CC-ADC enters Regular Current detection mode." mask="0x01" name="CADSE"/>
        </register>
        <register caption="CC-ADC Control and Status Register B" name="CADCSRB" offset="0xE7" size="1">
          <bitfield caption="" mask="0x40" name="CADACIE"/>
          <bitfield caption="Regular Current Interrupt Enable" mask="0x20" name="CADRCIE"/>
          <bitfield caption="CAD Instantenous Current Interrupt Enable" mask="0x10" name="CADICIE"/>
          <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x04" name="CADACIF"/>
          <bitfield caption="CC-ADC Accumulate Current Interrupt Flag" mask="0x02" name="CADRCIF"/>
          <bitfield caption="CC-ADC Instantaneous Current Interrupt Flag" mask="0x01" name="CADICIF"/>
        </register>
        <register caption="CC-ADC Control and Status Register C" name="CADCSRC" offset="0xE8" size="1">
          <bitfield caption="CC-ADC Voltage Scaling Enable" mask="0x01" name="CADVSE"/>
        </register>
        <register caption="CC-ADC Instantaneous Current" name="CADIC" offset="0xE4" size="2" mask="0xFFFF">
          <bitfield caption="CC-ADC Instantaneous Current" mask="0xFFFF" name="CADIC"/>
        </register>
        <register caption="ADC Accumulate Current" name="CADAC3" offset="0xE3" size="1" mask="0xFF">
          <bitfield caption="ADC accumulate current bits" mask="0xFF" name="CADAC" lsb="24"/>
        </register>
        <register caption="ADC Accumulate Current" name="CADAC2" offset="0xE2" size="1" mask="0xFF">
          <bitfield caption="ADC accumulate current bits" mask="0xFF" name="CADAC" lsb="16"/>
        </register>
        <register caption="ADC Accumulate Current" name="CADAC1" offset="0xE1" size="1" mask="0xFF">
          <bitfield caption="ADC accumulate current bits" mask="0xFC" name="CADAC" lsb="10"/>
          <bitfield caption="ADC accumulate current bits" mask="0x03" name="CADAC0" lsb="8"/>
        </register>
        <register caption="ADC Accumulate Current" name="CADAC0" offset="0xE0" size="1" mask="0xFF">
          <bitfield caption="ADC accumulate current bits" mask="0xFF" name="CADAC0"/>
        </register>
        <register caption="CC-ADC Regular Charge Current" name="CADRCC" offset="0xE9" size="1" mask="0xFF">
          <bitfield caption="CC-ADC Regular Charge Current" mask="0xFF" name="CADRCC"/>
        </register>
        <register caption="CC-ADC Regular Discharge Current" name="CADRDC" offset="0xEA" size="1" mask="0xFF">
          <bitfield caption="CC-ADC Regular Discharge Current" mask="0xFF" name="CADRDC"/>
        </register>
      </register-group>
    </module>
    <module caption="Two Wire Serial Interface" name="TWI">
      <register-group caption="Two Wire Serial Interface" name="TWI">
        <register caption="TWI Bus Control and Status Register" name="TWBCSR" offset="0xBE" size="1">
          <bitfield caption="TWI Bus Connect/Disconnect Interrupt Flag" mask="0x80" name="TWBCIF"/>
          <bitfield caption="TWI Bus Connect/Disconnect Interrupt Enable" mask="0x40" name="TWBCIE"/>
          <bitfield caption="TWI Bus Disconnect Time-out Period" mask="0x06" name="TWBDT" values="COMM_TW_BUS_TIMEOUT"/>
          <bitfield caption="TWI Bus Connect/Disconnect Interrupt Polarity" mask="0x01" name="TWBCIP"/>
        </register>
        <register caption="TWI (Slave) Address Mask Register" name="TWAMR" offset="0xBD" size="1">
          <bitfield caption="" mask="0xFE" name="TWAM"/>
        </register>
        <register caption="TWI Bit Rate register" name="TWBR" offset="0xB8" size="1" mask="0xFF">
          <bitfield caption="TWI Bit Rate bits" mask="0xFF" name="TWBR"/>
        </register>
        <register caption="TWI Control Register" name="TWCR" offset="0xBC" size="1" ocd-rw="R">
          <bitfield caption="TWI Interrupt Flag" mask="0x80" name="TWINT"/>
          <bitfield caption="TWI Enable Acknowledge Bit" mask="0x40" name="TWEA"/>
          <bitfield caption="TWI Start Condition Bit" mask="0x20" name="TWSTA"/>
          <bitfield caption="TWI Stop Condition Bit" mask="0x10" name="TWSTO"/>
          <bitfield caption="TWI Write Collition Flag" mask="0x08" name="TWWC"/>
          <bitfield caption="TWI Enable Bit" mask="0x04" name="TWEN"/>
          <bitfield caption="TWI Interrupt Enable" mask="0x01" name="TWIE"/>
        </register>
        <register caption="TWI Status Register" name="TWSR" offset="0xB9" size="1" ocd-rw="R">
          <bitfield caption="TWI Status" mask="0xF8" name="TWS" lsb="3"/>
          <bitfield caption="TWI Prescaler" mask="0x03" name="TWPS" values="COMM_TWI_PRESACLE"/>
        </register>
