avr-rust/avrd/packs/atmega/ATmega16HVB.atdf
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <register-group caption="Timer/Counter, 16-bit" name="TC0">
        <register caption="Timer/Counter0 Control Register B" name="TCCR0B" offset="0x45" size="1">
          <bitfield caption="Clock Select0 bit 2" mask="0x04" name="CS02"/>
          <bitfield caption="Clock Select0 bit 1" mask="0x02" name="CS01"/>
          <bitfield caption="Clock Select0 bit 0" mask="0x01" name="CS00" values="CLK_SEL_3BIT_EXT"/>
        </register>
        <register caption="Timer/Counter 0 Control Register A" name="TCCR0A" offset="0x44" size="1">
          <bitfield caption="Timer/Counter Width" mask="0x80" name="TCW0"/>
          <bitfield caption="Input Capture Mode Enable" mask="0x40" name="ICEN0"/>
          <bitfield caption="Input Capture Noise Canceler" mask="0x20" name="ICNC0"/>
          <bitfield caption="Input Capture Edge Select" mask="0x10" name="ICES0"/>
          <bitfield caption="Input Capture Select" mask="0x08" name="ICS0"/>
          <bitfield caption="Waveform Generation Mode" mask="0x01" name="WGM00"/>
        </register>
        <register caption="Timer Counter 0 Bytes" name="TCNT0" offset="0x46" size="2" mask="0xFFFF">
          <bitfield caption="Timer Counter 0 bits" mask="0xFFFF" name="TCNT0"/>
        </register>
        <register caption="Output Compare Register A" name="OCR0A" offset="0x48" size="1" mask="0xFF">
          <bitfield caption="Output Compare 0 A bits" mask="0xFF" name="OCR0A"/>
        </register>
        <register caption="Output Compare Register B" name="OCR0B" offset="0x49" size="1" mask="0xFF">
          <bitfield caption="Output Compare 0 B bits" mask="0xFF" name="OCR0B"/>
        </register>
        <register caption="Timer/Counter Interrupt Mask Register" name="TIMSK0" offset="0x6E" size="1">
          <bitfield caption="Timer/Counter n Input Capture Interrupt Enable" mask="0x08" name="ICIE0"/>
          <bitfield caption="Timer/Counter0 Output Compare B Interrupt Enable" mask="0x04" name="OCIE0B"/>
          <bitfield caption="Timer/Counter0 Output Compare A Interrupt Enable" mask="0x02" name="OCIE0A"/>
          <bitfield caption="Timer/Counter0 Overflow Interrupt Enable" mask="0x01" name="TOIE0"/>
        </register>
        <register caption="Timer/Counter Interrupt Flag register" name="TIFR0" offset="0x35" size="1" ocd-rw="R">
          <bitfield caption="Timer/Counter 0 Input Capture Flag" mask="0x08" name="ICF0"/>
          <bitfield caption="Timer/Counter0 Output Compare Flag B" mask="0x04" name="OCF0B"/>
          <bitfield caption="Timer/Counter0 Output Compare Flag A" mask="0x02" name="OCF0A"/>
          <bitfield caption="Timer/Counter0 Overflow Flag" mask="0x01" name="TOV0"/>
        </register>
        <register caption="General Timer/Counter Control Register" name="GTCCR" offset="0x43" size="1">
          <bitfield caption="Timer/Counter Synchronization Mode" mask="0x80" name="TSM"/>
          <bitfield caption="Prescaler Reset" mask="0x01" name="PSRSYNC"/>
        </register>
      </register-group>
      <value-group caption="" name="CLK_SEL_3BIT_EXT">
        <value caption="No Clock Source (Stopped)" name="VAL_0x00" value="0x00"/>
        <value caption="Running, No Prescaling" name="VAL_0x01" value="0x01"/>
        <value caption="Running, CLK/8" name="VAL_0x02" value="0x02"/>
        <value caption="Running, CLK/64" name="VAL_0x03" value="0x03"/>
        <value caption="Running, CLK/256" name="VAL_0x04" value="0x04"/>
        <value caption="Running, CLK/1024" name="VAL_0x05" value="0x05"/>
        <value caption="Running, ExtClk Tx Falling Edge" name="VAL_0x06" value="0x06"/>
        <value caption="Running, ExtClk Tx Rising Edge" name="VAL_0x07" value="0x07"/>
      </value-group>
    </module>
    <module caption="Cell Balancing" name="CELL_BALANCING">
      <register-group caption="Cell Balancing" name="CELL_BALANCING">
        <register caption="Cell Balancing Control Register" name="CBCR" offset="0xF1" size="1">
          <bitfield caption="Cell Balancing Enables" mask="0x0F" name="CBE" lsb="1"/>
        </register>
      </register-group>
    </module>
    <module caption="Battery Protection" name="BATTERY_PROTECTION">
      <register-group caption="Battery Protection" name="BATTERY_PROTECTION">
        <register caption="Battery Protection Parameter Lock Register" name="BPPLR" offset="0xFE" size="1" ocd-rw="R">
          <bitfield caption="Battery Protection Parameter Lock Enable" mask="0x02" name="BPPLE"/>
          <bitfield caption="Battery Protection Parameter Lock" mask="0x01" name="BPPL"/>
        </register>
        <register caption="Battery Protection Control Register" name="BPCR" offset="0xFD" size="1">
          <bitfield caption="External Protection Input Disable" mask="0x20" name="EPID"/>
          <bitfield caption="Short Circuit Protection Disabled" mask="0x10" name="SCD"/>
          <bitfield caption="Discharge Over-current Protection Disabled" mask="0x08" name="DOCD"/>
          <bitfield caption="Charge Over-current Protection Disabled" mask="0x04" name="COCD"/>
          <bitfield caption="Discharge High-current Protection Disable" mask="0x02" name="DHCD"/>
          <bitfield caption="Charge High-current Protection Disable" mask="0x01" name="CHCD"/>
        </register>
        <register caption="Battery Protection Short-current Timing Register" name="BPHCTR" offset="0xFC" size="1" mask="0x3F">
          <bitfield caption="Battery Protection Short-current Timing bits" mask="0x3F" name="HCPT"/>
        </register>
        <register caption="Battery Protection Over-current Timing Register" name="BPOCTR" offset="0xFB" size="1" mask="0x3F">
          <bitfield caption="Battery Protection Over-current Timing bits" mask="0x3F" name="OCPT"/>
        </register>
        <register caption="Battery Protection Short-current Timing Register" name="BPSCTR" offset="0xFA" size="1" mask="0x7F">
          <bitfield caption="Battery Protection Short-current Timing bits" mask="0x7F" name="SCPT"/>
        </register>
        <register caption="Battery Protection Charge-High-current Detection Level Register" name="BPCHCD" offset="0xF9" size="1" mask="0xFF">
          <bitfield caption="Battery Protection Charge-High-current Detection Level bits" mask="0xFF" name="CHCDL"/>
        </register>
        <register caption="Battery Protection Discharge-High-current Detection Level Register" name="BPDHCD" offset="0xF8" size="1" mask="0xFF">
          <bitfield caption="Battery Protection Discharge-High-current Detection Level bits" mask="0xFF" name="DHCDL"/>
        </register>
